In [31]:
# Imports
import panel as pn
pn.extension ("plotly")
import plotly.express as px
import pandas as pd
import hvplot.pandas as plt
import numpy as np
import os
from pathlib import Path
from dotenv import load_dotenv

In [70]:
# Read the census data into a Pandas DataFrame
file_path = Path("miami/SEAFOODMiami.csv")
seafood_data = pd.read_csv(file_path)

# Read the census data into a Pandas DataFrame
file_path = Path("miami/SUSHIROLLSMiami.csv")
sushi_rolls_data = pd.read_csv(file_path)

# Read the census data into a Pandas DataFrame
file_path = Path("miami/VEGGIEMiami.csv")
veggie_data = pd.read_csv(file_path)

# Read the census data into a Pandas DataFrame
file_path = Path("miami/pasta_miami.csv")
pasta_data = pd.read_csv(file_path)

# Read the census data into a Pandas DataFrame
file_path = Path("miami/pizza_miami.csv")
pizza_data = pd.read_csv(file_path)

In [71]:
seafood_data.head()

,Year,Week,ceviche_Miami_Ft_Lauderdale_FL,salmon_Miami_Ft_Lauderdale_FL
0,2017,2/5/2017,35,56.0
1,NaN,2/12/2017,21,50.0
2,NaN,2/19/2017,19,45.0
3,NaN,2/26/2017,20,45.0
4,NaN,3/5/2017,39,54.0

In [72]:
sushi_rolls_data.head()

,Year,Week,Spicy_tuna_roll_Miami_Ft_Lauderdale_FL,california_sushiroll_Miami_Ft_Lauderdale_FL
0,2017.0,2/5/2017,0,0
1,NaN,2/12/2017,0,46
2,NaN,2/19/2017,0,0
3,NaN,2/26/2017,0,44
4,NaN,3/5/2017,0,0

In [73]:
veggie_data.head()

,Year,Week,aloo gobi_Miami_Ft_Lauderdale_FL,salad_Miami_Ft_Lauderdale_FL
0,2017,2/5/2017,0,75.0
1,NaN,2/12/2017,0,45.0
2,NaN,2/19/2017,0,50.0
3,NaN,2/26/2017,0,52.0
4,NaN,3/5/2017,0,67.0

In [74]:
pasta_data.head()

,Year,Week,alfredo_pasta_Miami_Ft_Lauderdale_FL,Spaghetti_and meatballs_Miami_Ft_Lauderdale_FL
0,2017.0,2/5/2017,15,0
1,NaN,2/12/2017,46,0
2,NaN,2/19/2017,15,0
3,NaN,2/26/2017,0,0
4,NaN,3/5/2017,15,0

In [75]:
pizza_data.head()

,year,Week,Pepperoni_pizza_Miami_Ft_Lauderdale_FL,supreme_pizza_Miami_Ft_Lauderdale_FL
0,2017.0,2/5/2017,20,0
1,NaN,2/12/2017,19,0
2,NaN,2/19/2017,0,0
3,NaN,2/26/2017,0,0
4,NaN,3/5/2017,0,0